/* ===================================================
//----------------------------------------------------

// 给定两个点 P1
 和 P2
，其中 P1
 的坐标为 (x1,y1)
，P2
 的坐标为 (x2,y2)
，请你计算两点间的距离是多少。

//----------------------------------------------------
=================================================== */
#include<iostream>
#include<cmath>
#include<iomanip>
using namespace std;

int Distance()
{
	double x1, y1, x2, y2;
	cin >> x1 >> y1 >> x2 >> y2;
	cout << fixed << setprecision(4) << sqrt(pow(x2 - x1, 2) + pow(y2 - y1, 2)) << endl;
	return 0;
}