/* ===================================================
//----------------------------------------------------

// 在这个问题中，你需要读取一个整数值并将其分解为多张钞票的和，
每种面值的钞票可以使用多张，并要求所用的钞票数量尽可能少。
请你输出读取值和钞票清单。
钞票的可能面值有 100,50,20,10,5,2,1。
经过实验证明：在本题中，优先使用面额大的钞票可以保证所用的钞票总数量最少。

//----------------------------------------------------
=================================================== */
#include<iostream>
#include<cmath>
#include<iomanip>
using namespace std;

int Cash()
{
	int cash;
	cin >> cash;
	int arrCash[7] = {100, 50, 20, 10, 5, 2, 1};
	cout << cash << endl;
	for (int i = 0; i < 7; i++)
	{
		int tmp = 0;
		tmp = cash / arrCash[i];
		cash -= arrCash[i] * tmp;
		cout << tmp << " nota(s) de R$ " << arrCash[i]<<",00" << endl;
	}
	return 0;
}